# DimensionEqualityLabelFormatting Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionEqualityLabelFormatting Class
Members See Also
---
Instances of this class represent individual parameters used to make up a dimension equality formula for continuous linear or angular dimensions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public class DimensionEqualityLabelFormatting : IDisposable
```

Visual Basic
---
```text
Public Class DimensionEqualityLabelFormatting _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DimensionEqualityLabelFormatting : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DimensionEqualityLabelFormatting
# See Also
DimensionEqualityLabelFormatting Members
Autodesk.Revit.DB Namespace